Revit 2024 API
Outline.IsEmpty Property
 Identifies if the outline represents an empty outline.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public bool IsEmpty { get; }
Visual Basic
Public ReadOnly Property IsEmpty As Boolean
	Get
Visual C++
public:
property bool IsEmpty {
	bool get ();
}
See Also
Outline Class
Autodesk.Revit.DB Namespace